---
kind: method
id: M:Autodesk.Revit.DB.Macros.ApplicationEntryPoint.OnShutdownEO
source: html/51576d97-3760-3192-093a-7e92ee89d563.htm
---
# Autodesk.Revit.DB.Macros.ApplicationEntryPoint.OnShutdownEO Method

For Revit Macros internal use only.

## Syntax (C#)
```csharp
public void OnShutdownEO()
```